Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "soluble ea terraform-plan-scan --plan $SHOWFILE --format atlantis --fail high=1" in "/Users/charleskim/.atlantis/repos/cysk92/atlantis-example/3/default": exit status 2: running "soluble ea terraform-plan-scan --plan $SHOWFILE --format atlantis --fail high=1" in "/Users/charleskim/.atlantis/repos/cysk92/atlantis-example/3/default": 
[ Info] Getting https://api.soluble.cloud/api/v1/org/626919931078/rules/checkov-terraform-plan/rules.tgz
[ Info] Installing rules.tgz
[ Info] checkov-terraform-plan has no custom policies
WARNING: The requested image's platform (linux/amd64) does not match the detected host platform (linux/arm64/v8) and no specific platform was requested
[ Info] POST https://api.soluble.cloud/api/v1/xcp/checkov/data returned 200 in 3.48s
[ Info] Asessment uploaded, see https://app.soluble.cloud/assessments/details/13693?orgId=626919931078 for more information

Results:
Passed: 9 | Failed: 5 | Suppressed: 0

Violations:
Critical: 0 | High: 2 | Medium: 1 | Low: 2 | Info : 0

❌ Ensure that S3 buckets are encrypted with KMS by default
	Severity: High
	Resource: aws_s3_bucket.cloudrail

❌ Ensure all data stored in the S3 bucket is securely encrypted at rest
	Severity: High
	Resource: aws_s3_bucket.cloudrail

❌ Ensure that S3 bucket has cross-region replication enabled
	Severity: Medium
	Resource: aws_s3_bucket.cloudrail

❌ Ensure the S3 bucket has access logging enabled
	Severity: Low
	Resource: aws_s3_bucket.cloudrail

[Error] Terraform-plan Assessment has 2 high findings
❌ Ensure all data stored in the S3 bucket have versioning enabled
	Severity: Low
	Resource: aws_s3_bucket.cloudrail

/Users/charleskim/.atlantis/repos/cysk92/atlantis-example/3/default, default, 3441dfbbda72b177c8090b82d2390179bd71d471, 3, , testbranch, atlantis-example, atlantis-example, cysk92


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.cloudrail will be created
  + resource "aws_s3_bucket" "cloudrail" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cloudrail-non-encrypted-czx7zxchs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.cloudrail will be created
  + resource "aws_s3_bucket_public_access_block" "cloudrail" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.cloudrail,
│   on main.tf line 7, in resource "aws_s3_bucket" "cloudrail":
│    7:   acl    = "private"
│ 
│ Use the aws_s3_bucket_acl resource instead
│ 
│ (and one more similar warning elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/charleskim/.atlantis/repos/cysk92/atlantis-example/3/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/charleskim/.atlantis/repos/cysk92/atlantis-example/3/default/default.tfplan"

```
</details>

